ProjetP2Ruby/app/controllers/question_controller.rb

INSERT INTO "questions" ("title", "typeQuestion", "format", "file", "parent_id", "created_at", "updated_at", "survey_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @question = Question.new(:title => params[:title],:typeQuestion => params[:typeQuestion],:format => params[:format],:file => params[:file],:parent_id => params[:parent_id],:survey_id => params[:survey_id])



    if @question.save