ProjetP2Ruby/app/controllers/registration_controller.rb

  def index
    if params.has_key?(:id)
      @user = User.find(params[:id])
      render json: @user
    else
    @user = User.all
---
SELECT "users".* FROM "users"

  def create


    @user = User.new(:email => params[:email],:password => params[:password],:password_confirmation => params[:password],:firstName => params[:firstName],:lastName => params[:lastName])
    @user.nbSurvey = 0
    @user.status = 0

    if params.has_key?(:company)
      @user.company = params[:company]
    else
      @user.company = "Pas d'entreprise"
    end

    # user = User.create(email:params[:email],password:params[:password],password_confirmation:params[:password],firstName:params[:firstName],lastName:params[:lastName],nbSurvey:params[:nbSurvey],status:params[:status],company:params[:company])

    if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "firstName", "lastName", "nbSurvey", "status", "company") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy

    if User.exists?(params[:id])
      @user = User.find(params[:id])
      if @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]

  def update

    if User.exists?(params[:id])
      @user = User.find(params[:id])
      if params.has_key?(:email)
        @user.email = params[:email]
      end
      if params.has_key?(:password)
        @user.password = params[:password]
        @user.password_confirmation = params[:password]
      end
      if params.has_key?(:firstName)
        @user.firstName = params[:firstName]
      end
      if params.has_key?(:lastName)
        @user.lastName = params[:lastName]
      end
      if params.has_key?(:company)
        @user.company = params[:company]
      end
      if params.has_key?(:nbSurvey)
        @user.nbSurvey = params[:nbSurvey]
      end
      if params.has_key?(:status)
        @user.status = params[:status]
      end
        @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "encrypted_password" = ?, "firstName" = ?, "lastName" = ?, "company" = ?, "updated_at" = ? WHERE "users"."id" = ?