ProjetP2Ruby/app/controllers/survey_controller.rb

  def create

    @survey = Survey.new(:title => params[:title],:typeSurvey => params[:typeSurvey],:scope => params[:scope],:isActive => params[:isActive],:user_id => params[:user_id])
    o = [('a'..'z'), ('A'..'Z')].map(&:to_a).flatten
    @string = (0...50).map { o[rand(o.length)] }.join

    @survey.url = @string

    if @survey.save
---
INSERT INTO "surveys" ("title", "url", "typeSurvey", "scope", "publishDate", "isActive", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update

    if Survey.exists?(params[:id])
      @survey = Survey.find(params[:id])
      if params.has_key?(:title)
        @survey.title = params[:title]
      end
      if params.has_key?(:scope)
        @survey.scope = params[:scope]
      end
      if params.has_key?(:isActive)
        @survey.isActive = params[:isActive]
      end
      if params.has_key?(:closeDate)
        @survey.closeDate = params[:closeDate]
      end
      @survey.save
---
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "surveys" SET "title" = ?, "scope" = ?, "isActive" = ?, "updated_at" = ? WHERE "surveys"."id" = ?  [["title", "test"], ["scope", "private"], ["isActive", "f"], ["updated_at", "2018-01-26 15:18:40.551763"], ["id", 2]]

  def destroy
    @survey = Survey.find(params[:id])
    if @survey.destroy
---
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "surveys" WHERE "surveys"."id" = ?  [["id", 1]]